/**
 * Created by hongxiaoxia on 2018/6/28.
 */
var data = {
  newsList1:[
    {title:"黄山书社5个项目获得国家古籍整理专项经费资助",descri:"日前，在刚刚公布的2018年度国家古籍整理出版专项经费拟资助项目公示中，" +
    "黄山书社《江南女性别集五编》《桐城方氏七代遗书》《清代经世文选编》《李宗棠文集",
     source:"黄山书社",author:"程溪",time:"2018-06-05"
      },
    {title:"黄山书社5个项目获得国家古籍整理专项经费资助",descri:"日前，在刚刚公布的2018年度国家古籍整理出版专项经费拟资助项目公示中，" +
    "黄山书社《江南女性别集五编》《桐城方氏七代遗书》《清代经世文选编》《李宗棠文集",
      source:"黄山书社",author:"程溪",time:"2018-06-05"
    },
    {title:"黄山书社5个项目获得国家古籍整理专项经费资助",descri:"日前，在刚刚公布的2018年度国家古籍整理出版专项经费拟资助项目公示中，" +
    "黄山书社《江南女性别集五编》《桐城方氏七代遗书》《清代经世文选编》《李宗棠文集",
      source:"黄山书社",author:"程溪",time:"2018-06-05"
    },
    {title:"黄山书社5个项目获得国家古籍整理专项经费资助",descri:"日前，在刚刚公布的2018年度国家古籍整理出版专项经费拟资助项目公示中，" +
    "黄山书社《江南女性别集五编》《桐城方氏七代遗书》《清代经世文选编》《李宗棠文集",
      source:"黄山书社",author:"程溪",time:"2018-06-05"
    },
    {title:"黄山书社5个项目获得国家古籍整理专项经费资助",descri:"日前，在刚刚公布的2018年度国家古籍整理出版专项经费拟资助项目公示中，" +
    "黄山书社《江南女性别集五编》《桐城方氏七代遗书》《清代经世文选编》《李宗棠文集",
      source:"黄山书社",author:"程溪",time:"2018-06-05"
    }

  ]
}
var html = template("list2", data);
document.getElementById("list").innerHTML = html;
$(".pager").pagination({
  recordCount:90,       //总记录数
  pageSize: 10,           //一页记录数
  onPageChange: function (pageIndex) {
    console.log(pageIndex)
  }

});

